Table of Contents
 Class SingleSelection
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
public class SingleSelection : Selection
Inheritance
object
Selection
SingleSelection
Inherited Members
 Selection.Nodes
 Selection.Members
 Selection.Members2D
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 SingleSelection(ISet<IIdeaNode>, ISet<IIdeaMember1D>, IIdeaConnectionPoint, ISet<IIdeaMember2D>)
public SingleSelection(ISet<IIdeaNode> nodes, ISet<IIdeaMember1D> members, IIdeaConnectionPoint connectionPoint = null, ISet<IIdeaMember2D> members2D = null)
Parameters
nodes ISet<IIdeaNode>
members ISet<IIdeaMember1D>
connectionPoint IIdeaConnectionPoint
members2D ISet<IIdeaMember2D>
Properties
 ConnectionPoint
public IIdeaConnectionPoint ConnectionPoint { get; }
Property Value
IIdeaConnectionPoint
 Edit this page